#ifndef GLAYOUT_H_
#define GLAYOUT_H_

#include "graph_iterators.hxx"
#include "graph_vizualization.h"


//-------------------------------------------------------------
// Создание визуализации графа в виде решетки
//-------------------------------------------------------------

void matrix_layout(Graph G1, Graph vG1, unsigned int x_grid, unsigned int y_grid);

//------------------------------------------------------------------------------
// Создание визуализации графа на основе обхода матрицы
//------------------------------------------------------------------------------

void matrix_spiral_layout(Graph G1, Graph vG1, Queue Q1);

//------------------------------------------------------------------------------
// Создание визуализации графа на основе обхода по спирали центральности
//------------------------------------------------------------------------------

void spiral_layout(Graph G1, Graph vG1, Queue Q1);

//------------------------------------------------------------------------------
// Создание визуализации графа на основе алгоритма Фрюхтермана-Рейнгольда
//------------------------------------------------------------------------------

void force_directed_layout_communities(Community cG1, mQueue mQ1, iQueue iQ1, int w, int h);

//---------------------------------------------------------------------------------
// Создание визуализации сообщества на основе алгоритма Фрюхтермана-Рейнгольда
//---------------------------------------------------------------------------------

void force_directed_layout_vertices(Community cG1, Graph vG1, Queue vQ1);

#endif